Revit 2024 API
DocumentSavedAsEventArgs Class
 The event arguments used by the DocumentSavedAs event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentSavedAsEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class DocumentSavedAsEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class DocumentSavedAsEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs
See Also
DocumentSavedAsEventArgs Members
Autodesk.Revit.DB.Events Namespace